# users_info = test_json
# players = ['Иван', 'Борис', 'Егор', 'Палыч']


#test_json = {'Борис': [{'Висты': [{'Висты на Иван': 134,
#                      'Висты на Егор': 24,
#                      'Висты на Палыч': 54}],
#            'Гора': 10,
#            'Пуля': 28}],
# 'Егор': [{'Висты': [{'Висты на Борис': 86,
#                     'Висты на Палыч': 320,
#                     'Висты на Иван': 10}],
#           'Гора': 12,
#           'Пуля': 6}],
# 'Иван': [{'Висты': [{'Висты на Борис': 14,
#                     'Висты на Егор': 40,
#                     'Висты на Палыч': 82}],
#           'Гора': 32,
#           'Пуля': 16}],
# 'Палыч': [{'Висты': [{'Висты на Борис': 66,
#                      'Висты на Егор': 80,
#                      'Висты на Иван': 124}],
#            'Гора': 26,
#            'Пуля': 14}]}
